### Machine Learning Exam

In [ ]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [ ]:
dataset = pd.read_csv('Customer Data.csv')

In [ ]:
dataset

    ID   Age   Income  Gender Marital Status Buys
0    1    <21    High    Male         Single   No
1    2    <21    High    Male        Married   No
2    3  21-35    High    Male         Single  Yes
3    4    >35  Medium    Male         Single  Yes
4    5    >35     Low  Female         Single  Yes
5    6    >35     Low  Female        Married   No
6    7  21-35     Low  Female        Married  Yes
7    8    <21  Medium    Male         Single   No
8    9    <21     Low  Female        Married  Yes
9   10    >35  Medium  Female         Single  Yes
10  11    <21  Medium  Female        Married  Yes
11  12  21-35  Medium    Male        Married  Yes
12  13  21-35    High  Female         Single  Yes
13  14    >35  Medium    Male        Married   No

In [ ]:
dataset.describe()

            ID
count  14.0000
mean    7.5000
std     4.1833
min     1.0000
25%     4.2500
50%     7.5000
75%    10.7500
max    14.0000

In [ ]:
dataset = dataset.drop('ID',axis = 1)
dataset

     Age   Income  Gender Marital Status Buys
0     <21    High    Male         Single   No
1     <21    High    Male        Married   No
2   21-35    High    Male         Single  Yes
3     >35  Medium    Male         Single  Yes
4     >35     Low  Female         Single  Yes
5     >35     Low  Female        Married   No
6   21-35     Low  Female        Married  Yes
7     <21  Medium    Male         Single   No
8     <21     Low  Female        Married  Yes
9     >35  Medium  Female         Single  Yes
10    <21  Medium  Female        Married  Yes
11  21-35  Medium    Male        Married  Yes
12  21-35    High  Female         Single  Yes
13    >35  Medium    Male        Married   No

In [ ]:
dataset['Buys'].value_counts()

Yes    9
No     5
Name: Buys, dtype: int64

In [ ]:
from sklearn.preprocessing import LabelEncoder
le= LabelEncoder()
x=dataset.iloc[:,:-1]
x=x.apply(le.fit_transform)

In [ ]:
x

    Age   Income  Gender  Marital Status
0      1       0       1               1
1      1       0       1               0
2      0       0       1               1
3      2       2       1               1
4      2       1       0               1
5      2       1       0               0
6      0       1       0               0
7      1       2       1               1
8      1       1       0               0
9      2       2       0               1
10     1       2       0               0
11     0       2       1               0
12     0       0       0               1
13     2       2       1               0

In [ ]:
y = dataset.iloc[:,-1].values

In [ ]:
y

array(['No', 'No', 'Yes', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes', 'Yes',
       'Yes', 'Yes', 'Yes', 'No'], dtype=object)

In [ ]:
from sklearn.model_selection import train_test_split
x_train,x_test, y_train,y_test = train_test_split(x,y,test_size=0.2, random_state = 0)

In [ ]:
x_train

    Age   Income  Gender  Marital Status
11     0       2       1               0
2      0       0       1               1
13     2       2       1               0
9      2       2       0               1
1      1       0       1               0
7      1       2       1               1
10     1       2       0               0
3      2       2       1               1
0      1       0       1               1
5      2       1       0               0
12     0       0       0               1

In [ ]:
y_train

array(['Yes', 'Yes', 'No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'No',
       'Yes'], dtype=object)

In [ ]:
x_test

   Age   Income  Gender  Marital Status
8     1       1       0               0
6     0       1       0               0
4     2       1       0               1

In [ ]:
from sklearn.tree import DecisionTreeClassifier
classifier =  DecisionTreeClassifier(criterion= 'entropy')
classifier.fit(x_train,y_train)

DecisionTreeClassifier(criterion='entropy')

In [ ]:
y_pred= abc.predict(x_test)

In [ ]:
y_pred

array(['No', 'Yes', 'No'], dtype=object)

In [ ]:
test_x=np.array([1,1,0,0])

In [ ]:
test_x

array([1, 1, 0, 0])

In [ ]:
pred_y = classifier.predict([test_x])

D:\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

In [ ]:
pred_y

array(['No'], dtype=object)

In [ ]:
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report
cm = confusion_matrix(y_test,y_pred)

In [ ]:
cm

array([[0, 0],
       [2, 1]], dtype=int64)

In [ ]:
accuracy_score(y_test,y_pred)

0.3333333333333333

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
classifier =  KNeighborsClassifier(n_neighbors = 3)
classifier.fit(x_train,y_train)

KNeighborsClassifier(n_neighbors=3)

In [ ]:
y_pred = classifier.predict(x_test)
y_pred

array(['No', 'Yes', 'Yes'], dtype=object)

D:\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but KNeighborsClassifier was fitted with feature names
  warnings.warn(